# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# 0-P1/2
# 1-P2/4
# 2-P3/8
# 3-P4/16
# 4-P5/32

backbone:
  # [from, repeats, module, args]
  - [-1, 1, resnet18, [False]]  # 4
  - [-1, 1, HSPPF, [1024, 5]]  # 5
  - [-1, 1, PSA, [1024]] # 6

# YOLOv10.0n head
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, MUP, [512]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 9

  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, MUP, [256]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 12 (P3/8-small)

  - [-1, 1, MDown, [256]]
  - [[-1, 9], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 15 (P4/16-medium)

  - [-1, 1, MDown, [512]]
  - [[-1, 6], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 18 (P5/32-large)

  - [[14, 17, 20], 1, Detect_Efficient, [nc]] # Detect(P3, P4, P5)


# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect

# # Parameters
# nc: 80 # number of classes
# scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024]

# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, resnet18, [False]]  # 4
#   - [-1, 1, HSPPF, [1024, 5]] # 9
#   - [-1, 1, PSA, [1024]] # 10

# # YOLOv10.0n head
# head:
#   - [-1, 1, Conv, [512, 1, 1]]
#   - [-1, 1, MUP, [512]]
#   - [[-1, 6], 1, Concat, [1]] # cat backbone P4
#   - [-1, 3, C2f, [512]] # 13
#   - [-1, 1, Conv, [256, 1, 1]]

#   - [-1, 1, MUP, [256]]
#   - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#   - [-1, 3, C2f, [256]] # 16 (P3/8-small)

#   - [-1, 1, MDown, [256, 3, 2]]
#   - [[-1, 14], 1, Concat, [1]] # cat head P4
#   - [-1, 3, C2f, [512]] # 19 (P4/16-medium)

#   - [-1, 1, MDown, [512, 3, 2]]
#   - [[-1, 10], 1, Concat, [1]] # cat head P5
#   - [-1, 3, C2fCIB, [1024, True, True]] # 22 (P5/32-large)

#   - [[18, 21, 24], 1, Detect_Efficient, [nc]] # Detect(P3, P4, P5)
